{
    "class" : [
        {
            "name_str" : "Visionary",
            "page_url" : "visionary.html",
            "class_img" : "/_SiteResources/Images/noun_robotic hand_2838670.png",
            "description_str" : "Armed with the most advanced arsenal of devices and weapons of the era, the Visionary is a durable and versatile Primary Techcaster who contributes to combat and excels at utility.  ",

            "class_type" : "Primary Tech Caster",
            "primary_ability" : "Intelligence",
            "saving_throws" : "Intelligence, Wisdom",
            
            "hit_die_int" : 6,
            "hit_die_average_int" : 4,

            "proficiencies_armor" : "None",
            "proficiencies_weapons" : "Simple Tech Weapons",
            "proficiencies_tools" : "Choose any two",
            "proficiencies_saves" : "Intelligence, Wisdom",
            "proficiencies_skills" : "Choose any three",
            
            "equipment_armor" : "Forged Plate, Steel",
            "equipment_weapons" : "Any Simple Tech Weapon",
            "equipment_tools" : "One tool with which you are proficient",
            "equipment_packs" : "One Inventor's Pack",
            "equipment_variant" : "5d4 x 100 GC",

            "casting_known_per_level" : 4,
            "casting_points_per_level" : 4,
            "casting_max_per_level_denominator" : 2,

            "class_feat_table_links" : [
                "<a href='#Techcasting-1'>Techcasting</a>, <a href='#Augmented Armor-1'>Augmented Armor</a>",
                "<a href='#Expertise-2'>Expertise</a>, Subclass Feature",
                "---",
                "<a href='#Ability Score Improvement-4'>Ability Score Improvement</a>, <a href='#Advanced Armor-4'>Advanced Armor</a>",
                "---",
                "<a href='#Reverse Engineering-6'>Reverse Engineering</a>",
                "---",
                "<a href='#Ability Score Improvement-8'>Ability Score Improvement</a>, Subclass Feature",
                "---",
                "<a href='#Expertise-10'>Expertise</a>, <a href='#Reverse Engineering-10'>Reverse Engineering</a>",
                "---",
                "<a href='#Ability Score Improvement-12'>Ability Score Improvement</a>, <a href='#Superior Armor-12'>Superior Armor</a>",
                "---",
                "<a href='#Reverse Engineering-14'>Reverse Engineering</a>",
                "---",
                "<a href='#Ability Score Improvement-16'>Ability Score Improvement</a>, Subclass Feature",
                "---",
                "<a href='#Expertise-18'>Expertise</a>, <a href='#Reverse Engineering-18'>Reverse Engineering</a>",
                "<a href='#Ability Score Improvement-19'>Ability Score Improvement</a>",
                "<a href='#Ultimate Armor-20'>Ultimate Armor</a>"
                ],
            "class_feat_descriptions" : [
                {
                    "name_str" : "Techcasting",
                    "level" : 1,
                    "description_str" : "You have gained intimate knowledge of technology far beyond your time, and are capable of apply these technologies in a variety of ways.  See the Rules for Techcasting mechanics and Technologies list.  <ul><li><b>Technologies Known:</b>  You learn 4 Technologies of your choice, and you learn an additional 4 at each higher Visionary level as shown in the Technologies Known column of the Visionary table.  You may not learn a Technology of a level higher than your Max Technology Level, and you may learn a Technology at the same time you learn its prerequisite.  </li><br><li><b>Tech Points:</b>  You have a number of Tech Points equal to your Visionary level x 8, as shown in the Tech Points column of the Visionary table, + your Int modifier.  You expend these Tech Points to cast Tech Powers.  You regain all expended Tech Points when you finish a long rest.  </li><br><li><b>Max Tech Level:</b>  Many Technologies can be overpowered, consuming more Tech Points to create a greater effect.  You can overpower these abilities to a maximum level, which increases at higher levels, as shown in the Max Tech Level column of the Visionary table.  You may only cast Technologies at 6th, 7th, 8th, and 9th-level once.  You regain the ability to do so after a long rest.  </li><br><li><b>Techcasting Ability:</b>  Your Techcasting ability is Intelligence.  You use your Intelligence modifier whenever a Technology refers to your Techcasting ability.  Additionally, you use this ability score modifier when setting the saving throw DC for a Technology you cast and when making an attack roll with one.  </li><br><li><b>Technology save DC</b> = 8 + your proficiency bonus + your Techcasting ability modifier</li><br><li><b>Technology attack modifier</b> = your proficiency bonus + your Techcasting ability modifier</li></ul>"
                },
                {
                    "name_str" : "Augmented Armor",
                    "level" : 1,
                    "description_str" : "Your inventive pursuits have led to you making armor that serves as a conduit for your technology.  As part of a Long Rest, you can turn a suit of mundane armor you have access to into Augmented Armor, provided you have Inventor's Tools on hand.  You can don or doff the Augmented Armor over the course of 1 minute.  The Augmented Armor continues to be Augmented Armor until you create another set of Augmented Armor, or it is destroyed.  If you die while wearing the Augmented Armor, it is destroyed.  The Augmented Armor has the following traits while worn by you:<ul><li>Your Strength score becomes equal to your Intelligence score as long as it is not already higher.  You are also considered proficient with the armor.  </li>  <li>You can use the Augmented Armor as a Techcasting focus for your Visionary spells.  </li><li>The Augmented Armor attaches to you and can’t be removed against your will.  </li><li>The Augmented Armor expands to cover your entire body, although you can remove or attach the helmet as an action.  </li><li>The Augmented Armor replaces any missing limbs, functioning identically to a limb it replaces.  </li></ul>"
                },
                {
                    "name_str" : "Expertise",
                    "level" : 2,
                    "description_str" : "Choose one of your skill proficiencies and one of your tool proficiencies.  Your proficiency bonus is doubled for any ability check you make that uses the chosen proficiencies.  "
                },
                {
                    "name_str" : "Ability Score Improvement",
                    "level" : 4,
                    "description_str" : "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1.  You can’t increase an ability score above 20 using this feature.  You may gain this feature multiple times.  Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead.  "
                },
                {
                    "name_str" : "Advanced Armor",
                    "level" : 4,
                    "description_str" : "Your inventive pursuits have led to you making armor that serves as a conduit for your technology.  As part of a Long Rest, you can turn a suit of mundane armor you have access to into Advanced Armor, provided you have Inventor's Tools on hand.  You can don or doff the Advanced Armor an Action.  The Advanced Armor continues to be Advanced Armor until you create another set of Advanced Armor, or it is destroyed.  If you die while wearing the Advanced Armor, it is destroyed.  The Advanced Armor has the following traits while worn by you:<ul><li>Your Strength score becomes equal to your Intelligence score as long as it is not already higher.  You are also considered proficient with the armor.  </li>  <li>You can use the Advanced Armor as a Techcasting focus for your Visionary spells.  </li><li>The Advanced Armor attaches to you and can’t be removed against your will.  </li><li>The Advanced Armor expands to cover your entire body, although you can retract or deploy the helmet as an action.  </li><li>The Advanced Armor replaces any missing limbs, functioning identically to a limb it replaces.  </li><li>When you make an Intelligence check, you can treat the d20 result as equal to your Intelligence modifier if the result before modifiers is lower.  </li><li>You can survive in the vacuum of space for a number of minutes equal to your Intelligence modifier.  This ability recharges upon a long rest within a hospitable environment.  </li></ul>"
                },
                {
                    "name_str" : "Reverse Engineering",
                    "level" : 6,
                    "description_str" : "Choose one Technology, Power, or Spell from any class casting list that you have witnessed being cast at least once.  Events witnessed within your backstory do not qualify for this feature.  The chosen Technology, Power, or Spell must not be of a higher level than the Maximum Technology Level for your current Visionary level.  Your selected Technology, Power, or Spell counts as a Visionary Technology for you, and you are able to learn it as normal at the same level you choose it.  If you are starting at higher levels or have not witnessed any Technologies, Powers, or Spells being cast upon gaining this feature, your GM may provide a list of Technologies, Powers, or Spells for you to choose from.  You may gain this feature multiple times.  "
                },
                {
                    "name_str" : "Ability Score Improvement",
                    "level" : 8,
                    "description_str" : "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1.  You can’t increase an ability score above 20 using this feature.  You may gain this feature multiple times.  Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead.  "
                },
                {
                    "name_str" : "Expertise",
                    "level" : 10,
                    "description_str" : "Choose one of your skill proficiencies and one of your tool proficiencies.  Your proficiency bonus is doubled for any ability check you make that uses the chosen proficiencies.  "
                },
                {
                    "name_str" : "Reverse Engineering",
                    "level" : 10,
                    "description_str" : "Choose one Technology, Power, or Spell from any class casting list that you have witnessed being cast at least once.  Events witnessed within your backstory do not qualify for this feature.  The chosen Technology, Power, or Spell must not be of a higher level than the Maximum Technology Level for your current Visionary level.  Your selected Technology, Power, or Spell counts as a Visionary Technology for you, and you are able to learn it as normal at the same level you choose it.  If you are starting at higher levels or have not witnessed any Technologies, Powers, or Spells being cast upon gaining this feature, your GM may provide a list of Technologies, Powers, or Spells for you to choose from.  You may gain this feature multiple times.  "
                },
                {
                    "name_str" : "Ability Score Improvement",
                    "level" : 12,
                    "description_str" : "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1.  You can’t increase an ability score above 20 using this feature.  You may gain this feature multiple times.  Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead.  "
                },
                {
                    "name_str" : "Superior Armor",
                    "level" : 12,
                    "description_str" : "Your inventive pursuits have led to you making armor that serves as a conduit for your technology.  As part of a Long Rest, you can turn a suit of mundane armor you have access to into Superior Armor, provided you have Inventor's Tools on hand.  You can don or doff the Superior Armor as a Bonus Action.  The Superior Armor continues to be Superior Armor until you create another set of Superior Armor, or it is destroyed.  If you die while wearing the Superior Armor, it is destroyed.  The Superior Armor has the following traits while worn by you:<ul><li>Your Strength score becomes equal to your Intelligence score as long as it is not already higher.  You are also considered proficient with the armor.  </li>  <li>You can use the Superior Armor as a Techcasting focus for your Visionary spells.  </li><li>The Superior Armor attaches to you and can’t be removed against your will.  </li><li>The Superior Armor expands to cover your entire body, although you can retract or deploy the helmet as a bonus action.  </li><li>The Superior Armor replaces any missing limbs, functioning identically to a limb it replaces.  </li><li>When you make an Intelligence check, you can treat the d20 result as equal to half of your Intelligence score (rounded down) if the result before modifiers is lower.  </li><li>You can survive in the vacuum of space for a number of hours equal to your Intelligence modifier.  This ability recharges upon a long rest within a hospitable environment.  </li></ul>"
                },
                {
                    "name_str" : "Reverse Engineering",
                    "level" : 14,
                    "description_str" : "Choose one Technology, Power, or Spell from any class casting list that you have witnessed being cast at least once.  Events witnessed within your backstory do not qualify for this feature.  The chosen Technology, Power, or Spell must not be of a higher level than the Maximum Technology Level for your current Visionary level.  Your selected Technology, Power, or Spell counts as a Visionary Technology for you, and you are able to learn it as normal at the same level you choose it.  If you are starting at higher levels or have not witnessed any Technologies, Powers, or Spells being cast upon gaining this feature, your GM may provide a list of Technologies, Powers, or Spells for you to choose from.  You may gain this feature multiple times.  "
                },
                {
                    "name_str" : "Ability Score Improvement",
                    "level" : 16,
                    "description_str" : "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1.  You can’t increase an ability score above 20 using this feature.  You may gain this feature multiple times.  Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead.  "
                },
                {
                    "name_str" : "Expertise",
                    "level" : 18,
                    "description_str" : "Choose one of your skill proficiencies and one of your tool proficiencies.  Your proficiency bonus is doubled for any ability check you make that uses the chosen proficiencies.  "
                },
                {
                    "name_str" : "Reverse Engineering",
                    "level" : 18,
                    "description_str" : "Choose one Technology, Power, or Spell from any class casting list that you have witnessed being cast at least once.  Events witnessed within your backstory do not qualify for this feature.  The chosen Technology, Power, or Spell must not be of a higher level than the Maximum Technology Level for your current Visionary level.  Your selected Technology, Power, or Spell counts as a Visionary Technology for you, and you are able to learn it as normal at the same level you choose it.  If you are starting at higher levels or have not witnessed any Technologies, Powers, or Spells being cast upon gaining this feature, your GM may provide a list of Technologies, Powers, or Spells for you to choose from.  You may gain this feature multiple times.  "
                },
                {
                    "name_str" : "Ability Score Improvement",
                    "level" : 19,
                    "description_str" : "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1.  You can’t increase an ability score above 20 using this feature.  You may gain this feature multiple times.  Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead.  "
                },
                {
                    "name_str" : "Ultimate Armor",
                    "level" : 20,
                    "description_str" : "Your inventive pursuits have led to you making armor that serves as a conduit for your technology.  As part of a Long Rest, you can turn a suit of mundane armor you have access to into Ultimate Armor, provided you have Inventor's Tools on hand.  You can don or doff the Ultimate Armor as part of any Action, Bonus Action, or Reaction you take.  In addition, when the Ultimate Armor is doffed by you, you can choose to have it collapse into a small housing unit.  The housing unit takes on a form of your choosing, and can be no smaller a thick wristwatch.  You can use the housing unit as a Tech casting focus for your Visionary spells while you wear it as components of the Ultimate Armor dynamically deploy and retract as needed.  The Ultimate Armor continues to be Ultimate Armor until you create another set of Ultimate Armor, or it is destroyed.  If you die while wearing the Ultimate Armor, it is destroyed.  The Ultimate Armor has the following traits while worn by you:<ul><li>Your Strength score becomes equal to your Intelligence score as long as it is not already higher.  You are also considered proficient with the armor.  </li>  <li>You can use the Ultimate Armor as a Techcasting focus for your Visionary spells, and you need not supply any components that do not have a cost while doing so.  </li><li>The Ultimate Armor attaches to you and can’t be removed against your will.  </li><li>The Ultimate Armor expands to cover your entire body, although you can retract or deploy the helmet once per turn.  </li><li>The Ultimate Armor replaces any missing limbs, functioning identically to a limb it replaces.  </li><li>When you make an Intelligence check, you can treat the d20 result as equal to your Intelligence score if the result before modifiers is lower.  </li><li>Choose two of your Technologies that are of 2nd level or lower.  You can cast those Technologies at their lowest level without expending any Tech Points.  </li><li>You can survive in the vacuum of space for a number of days equal to your Intelligence modifier.  This ability recharges upon a long rest within a hospitable environment.  </li></ul>"
                }
            ]
        }
    ]
}
